app/Document.php

    public static function get($module, $type, $id, $lang = 'ru')
    {

        $res = Document::where([
            ['module', '=', $module],
            ['module_id', '=', $id],
            ['type', '=', $type],
            ['lang', '=', $lang]
        ])->first();
---
select * from `documents` where (`module` = 'product' and `module_id` = 7 and `type` = 'desc' and `lang` = 'ru') limit 1