app/Http/Controllers/AdminHomeController.php

	public function index( Request $request ) {
		if ( Auth::user()->roles[0]->name == 'admin' ) {
			//разрешаем админу
			$request->user()->authorizeRoles( [ 'admin' ] );

			$users         = User::all();
			$products      = Product::all();
			$categories    = Category::all();
			$pages         = Page::all();
			$tags          = Tag::all();
			$contacts      = Contact::all();
			$contacts_count   = $contacts->count();
			$orders        = Order::all();
			$order_count   = $orders->count();
			$comments      = Comment::all();
			$manufacturers = Manufacturer::all();
            $orders = Order::where('confirm', 0)->orderBy( 'created_at', 'desc' )->limit(5)->get();
---
select * from `users`
select * from `products`
select * from `categories`
select * from `pages`
select * from `tags`
select * from `contacts`
select * from `orders`
select * from `comments`
select * from `manufacturers`
select * from `orders` where `confirm` = 0 order by `created_at` desc limit 5