app/Http/Controllers/ApiController.php

select * from `categories` where `id` = 1 limit 1
select `group_attributes`.*, `category_group_attribute`.`category_id` as `pivot_category_id`, `category_group_attribute`.`group_attribute_id` as `pivot_group_attribute_id` from `group_attributes` inner join `category_group_attribute` on `group_attributes`.`id` = `category_group_attribute`.`group_attribute_id` where `category_group_attribute`.`category_id` in (1)
---
    public function group(Request $request)
    {

        $category_id = $request->category_id;

        $data = Category::where('id', $category_id)->with('group_attributes')->first();

select * from `group_attributes` where `group_attributes`.`id` = 3 limit 1
---
    public function attributes(Request $request)
    {

        $attr = $request->attr;

        $res = GroupAttribute::with('attributes')->findOrFail($attr);

select * from `group_attributes` where `group_attributes`.`id` in (1, 2)
select `attributes`.*, `product_attribute`.`product_id` as `pivot_product_id`, `product_attribute`.`attribute_id` as `pivot_attribute_id` from `attributes` inner join `product_attribute` on `attributes`.`id` = `product_attribute`.`attribute_id` where `product_attribute`.`product_id` in (1)
select `attributes`.*, `product_attribute`.`product_id` as `pivot_product_id`, `product_attribute`.`attribute_id` as `pivot_attribute_id`, `product_attribute`.`product_id` as `pivot_product_id`, `product_attribute`.`attribute_id` as `pivot_attribute_id` from `attributes` inner join `product_attribute` on `attributes`.`id` = `product_attribute`.`attribute_id` where `product_attribute`.`product_id` in (1)
---
    public function getAttributes(Request $request){

        $product = Product::find($request->product_id);

        $product->load(['attributes.group_attribute' => function ($items) use (&$group_attributes) {
            $group_attributes = $items->get();
        }]);

        $product->load(['attributes' => function ($items) use (&$select_attributes) {
            $select_attributes = $items->get();
        }]);

delete from `product_attribute` where `product_id` = 1 and `attribute_id` in (7)
---
    public function saveAttr(Request $request){

        $product = Product::find($request->product_id);

        if($product->attributes()->sync($request->attribute_id)){

select * from `options`
select `product_values`.*, `product_product_values`.`product_id` as `pivot_product_id`, `product_product_values`.`product_value_id` as `pivot_product_value_id` from `product_values` inner join `product_product_values` on `product_values`.`id` = `product_product_values`.`product_value_id` where `product_product_values`.`product_id` = 1
select * from `value_options` where `value_options`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17)
select * from `options` where `options`.`id` in (1, 2)
---
    public function getSelectedOption(Request $request){

        $product = Product::find($request->product_id);
        $options = Option::with('values')->get();

        $selected_product_values = $product->productValues()->get();
        $selected_values = null;

        $selected_product_values->load(['valueOption' => function ($items) use (&$selected_values) {
            $selected_values = $items->get();
        }]);
        $selected = [];
        $select_options = null;
        if ($selected_values != null) {
            $selected_values->load(['select_options' => function ($items) use (&$select_options) {
                $select_options = $items->get();
            }]);

select * from `manufacturers`
select * from `suppliers`
---
    public function getData(Request $request){

        $product = Product::find($request->product_id);

        $manufacturers = Manufacturer::all();
        $suppliers = Supplier::all();

select * from `categories` where `categories`.`id` in (1, 2, 3, 5, 7)
select * from `manufacturers` where `manufacturers`.`id` in (3, 4, 5, 6, 8)
select * from `products`
---
    public function replicateProduct(Request $request){

        $select = $request->select_product;

        for($i = 0;$i < count($select);$i++){
            $product = Product::find($select[$i]['id']);

            $new_product = $product->replicate();
            /*$new_product->category_id = Category::first()->id;
            $new_product->category_title = Category::first()->title;*/
            $new_product->public = 0;
//            $new_product->image = null;
            $new_product->save();

            $documents = Document::where('module_id', $select[$i]['id'])->get();

            foreach ($documents as $document) {

                $doc = Document::find($document->id);

                $new_doc = $doc->replicate();
                $new_doc->module_id = $new_product->id;
                $new_doc->save();

            }

            $new_product->categories()->syncWithoutDetaching($new_product->category_id);

        }

        $products = Product::with(['category', 'manufacturer'])->get();

select * from `value_options` where `image` = 'option_value_1611509490.jpeg' limit 1
---
    public function deleteOptionImage(Request $request){

        $value = ValueOption::where('image', $request->file)->first();