app/Http/Controllers/AttributeController.php

select * from `attributes`
select * from `contacts`
select * from `orders`
---
    public function indexAdmin(Request $request)
    {
        //разрешаем админу
        $request->user()->authorizeRoles(['admin']);
        $attributes = Attribute::all();

        $contacts      = Contact::all();
        $contacts_count   = $contacts->count();
        $orders        = Order::all();

select * from `group_attributes`
select `categories`.*, `category_group_attribute`.`group_attribute_id` as `pivot_group_attribute_id`, `category_group_attribute`.`category_id` as `pivot_category_id` from `categories` inner join `category_group_attribute` on `categories`.`id` = `category_group_attribute`.`category_id` where `category_group_attribute`.`group_attribute_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14)
select * from `languages`
select * from `contacts`
select * from `orders`
---
    public function create(Request $request)
    {
        //разрешаем админу
        $request->user()->authorizeRoles(['admin']);
        $attribute = null;
        $group_attributes = GroupAttribute::with('categories')->get();
        $langs = Language::all();

        $contacts      = Contact::all();
        $contacts_count   = $contacts->count();
        $orders        = Order::all();

insert into `attributes` (`name_ru`, `name_uk`, `item_name_ru`, `item_name_uk`, `group_attribute_id`, `sort`, `updated_at`, `created_at`) values ('какой-то цвет', 'какой-то цвiт', 'цвет приятный!', 'цвiт приятный!', '3', '', '2021-01-24 18:29:24', '2021-01-24 18:29:24')
select * from `languages`
---
    public function store(Request $request)
    {
//        dd($request);
        $attribute = new Attribute;
        $attribute->name_ru = $request->title_ru;
        $attribute->name_uk = $request->title_uk;
        $attribute->item_name_ru = $request->long_title_ru;
        $attribute->item_name_uk = $request->long_title_uk;
        $attribute->group_attribute_id = $request->group_attribute_id;
        $attribute->sort = $request->sort;
        $attribute->save();

        $langs = Language::all();