app/Http/Controllers/CategoryController.php

select * from `categories` where `categories`.`id` in (0, 5)
select * from `contacts`
select * from `orders`
---
    public function indexAdmin(Request $request)
    {
        //разрешаем админу
        $request->user()->authorizeRoles(['admin']);

        $categories = Category::with('parent')->get();
        $contacts      = Contact::all();
        $contacts_count   = $contacts->count();
        $orders        = Order::all();

select * from `languages`
select * from `contacts`
select * from `orders`
---
    public function edit(Request $request, $id)
    {
        //разрешаем админу
        $request->user()->authorizeRoles(['admin']);

        $categories = Category::get()
            ->pluck('title_ru', 'id')
            ->prepend('Выбрать', 0);

        $langs = Language::all();
        $contacts      = Contact::all();
        $contacts_count   = $contacts->count();
        $orders        = Order::all();

delete from `category_group_attribute` where `category_id` = 10
delete from `documents` where (`module` = 'category' and `module_id` = 10)
delete from `categories` where `id` = 10
---
    public function destroy($id)
    {
        $category = Category::find($id);
        $category->group_attributes()->detach();
        Document::where([
            ['module', 'category'],
            ['module_id', $category->id]
        ])->delete();
        $category->delete();