app/Http/Controllers/ManufacturerController.php

select * from `manufacturers`
select * from `contacts`
select * from `orders`
---
    public function indexAdmin(Request $request)
    {
        //разрешаем админу
        $request->user()->authorizeRoles(['admin']);

        $manufacturers = Manufacturer::all();

        $contacts      = Contact::all();
        $contacts_count   = $contacts->count();
        $orders        = Order::all();

select * from `languages`
select * from `contacts`
select * from `orders`
---
    public function create(Request $request)
    {
        //разрешаем админу

        $request->user()->authorizeRoles(['admin']);
        $langs = Language::all();
        $manufacturer = null;

        $contacts      = Contact::all();
        $contacts_count   = $contacts->count();
        $orders        = Order::all();

insert into `manufacturers` (`title_ru`, `title_uk`, `meta_h1_ru`, `meta_h1_uk`, `link`, `sort`, `description_ru`, `description_uk`, `seo`, `image`, `updated_at`, `created_at`) values ('asdfafsd', 'asdfafsd', 'asdfafsd', 'asdfafsd', 'asdf', '0', 'dsfafdsa', 'adfs', '<p>asdf</p>', 'perchatki.jpg', '2021-01-24 20:05:25', '2021-01-24 20:05:25')
select * from `languages`
---
                ->save($destinationPath . $image_name);
            $manufacturer->image = $image_name;
        }
        $manufacturer->save();

        $langs = Language::all();