app/Http/Controllers/OptionController.php

select * from `options`
select * from `contacts`
select * from `orders`
---
    public function indexAdmin( Request $request ) {
        //разрешаем админу
        $request->user()->authorizeRoles( [ 'admin' ] );

        $options = Option::all();

        $contacts      = Contact::all();
        $contacts_count   = $contacts->count();
        $orders        = Order::all();

select * from `options`
select * from `languages`
select * from `contacts`
select * from `orders`
---
    public function create( Request $request )
    {
        //разрешаем админу
        $request->user()->authorizeRoles( [ 'admin' ] );

        $option = Option::all();
        $langs = Language::all();

        $contacts      = Contact::all();
        $contacts_count   = $contacts->count();
        $orders        = Order::all();

select * from `options` where `options`.`id` = '2' limit 1
select * from `languages`
select * from `contacts`
select * from `orders`
---
    public function edit(Request $request /*Option $option*/, $id)
    {
        $option = Option::with('values')->find($id);
        $langs = Language::all();

        $arr = [];
        foreach ($langs as $lang) {
            $arr[$lang->locate_code] = Document::get('option', 'title', $option->id, $lang->locate_code);
        }
        $option->title = $arr;
        foreach($option->values as $value){

            $arr = [];
            foreach ($langs as $lang) {
                $arr[$lang->locate_code] = Document::get('option_value', 'value', $value->id, $lang->locate_code);
            }

            $value->value = $arr;
        }

        $contacts      = Contact::all();
        $contacts_count   = $contacts->count();
        $orders        = Order::all();