app/Http/Controllers/ProductController.php

select * from `categories` where `categories`.`id` in (1, 2, 3)
select * from `manufacturers` where `manufacturers`.`id` in (3, 4, 5, 8)
select * from `products` limit 10
select * from `categories`
select * from `manufacturers`
select * from `contacts`
select * from `orders`
---
    public function indexAdmin(Request $request)
    {
        //разрешаем админу
        $request->user()->authorizeRoles(['admin']);
        $settings = Setting::first();
        $products = Product::with(['category', 'manufacturer'])->take(10)->get();
        $count_p = Product::all()->count();
        $categories = Category::all();
        $manufacturers = Manufacturer::all();

        $contacts = Contact::all();
        $contacts_count = $contacts->count();
        $orders = Order::all();

select `id`, `title_ru` from `categories`
select * from `options`
select * from `tags`
select * from `group_attributes`
select * from `languages`
select * from `currencies`
select * from `contacts`
select * from `orders`
---
    public function create(Request $request)
    {
        //разрешаем админу
        $request->user()->authorizeRoles(['admin']);

        $categories_json = Category::select(['id', 'title_ru'])->get();

        $categories = Category::get()->pluck('title_ru', 'id');
        $settings = Setting::first();
        $options = Option::with('values')->get();
        $tags = Tag::all();

        $manufacturers = Manufacturer::get()->pluck('title_ru', 'id');
        $suppliers = Supplier::get()->pluck('title', 'id');
//        $tags = Tag::get()->pluck('name', 'id');
        $group_attributes = GroupAttribute::all();

        /*foreach ($group_attributes as $group) {
            $group->title = $group->title_ru;
        }*/
        $langs = Language::all();
        $currencies = Currency::all();
        $product = null;

        $contacts = Contact::all();
        $contacts_count = $contacts->count();
        $orders = Order::all();

insert into `products` (`title_ru`, `title_uk`, `meta_h1_ru`, `meta_h1_uk`, `price_stock`, `stock`, `type_stock`, `status_stock`, `start_stock`, `end_stock`, `seo`, `price`, `how_size`, `category_id`, `category_title`, `undiscounted`, `vendor_code`, `ude`, `course`, `percent`, `lens_height`, `lens_width`, `bridge_width`, `long_arms`, `frame_width`, `availability`, `type`, `model`, `supplier`, `description_ru`, `description_uk`, `public`, `alt`, `manufacturer_id`, `manufacturer_title`, `image`, `slug_ru`, `slug_uk`, `updated_at`, `created_at`) values ('fdsafdsa', 'adsfaf', 'fdsafdsa', 'adsfaf', 10618, '32', 'percent', 0, '2021-01-25 14:12', '2021-01-31 14:12', '', '15616', '', '2', 'Мужские перчатки', '17351', '311', '244', '64', '10', '', '', '', '', '', '2', 'null', '', '', 'asdffdas', 'sdfafads', '', '', '4', 'Doppler', 'product_main_1611486739.jpeg', 'fdsafdsa', 'adsfaf', '2021-01-24 13:13:41', '2021-01-24 13:13:41')
select * from `languages`
---
            $product->image = $image->name;
        }

        $product->save();

        $langs = Language::all();

insert into `product_attribute` (`attribute_id`, `product_id`) values ('1', 9), ('2', 9), ('5', 9), ('6', 9), ('9', 9), ('10', 9), ('11', 9), ('12', 9), ('13', 9), ('16', 9), ('17', 9)
insert into `product_tag` (`product_id`, `tag_id`) values (9, '3'), (9, '4')
---
        }

        //заись в сводную таблицу
        $product->attributes()->attach($request->attribute_id);

        //запись в сводную таблицу
        $product->tags()->attach($request->tag_id);

insert into `product_product_values` (`product_id`, `product_value_id`) values (9, 177)
---
            $product->categories()->syncWithoutDetaching($request->category_id);
        }

        $product->productValues()->attach($values);

select * from `currencies`
select * from `contacts`
select * from `orders`
---
    public function edit(Request $request, $id)
    {
        //разрешаем админу
        $request->user()->authorizeRoles(['admin']);
        $currencies = Currency::all();
        $product = Product::find($id);
        $settings = Setting::first();
        $categories_json = Category::get();
        $categories = Category::get()->pluck('title', 'id');

        $contacts = Contact::all();
        $contacts_count = $contacts->count();
        $orders = Order::all();

select * from `options`
select `product_values`.*, `product_product_values`.`product_id` as `pivot_product_id`, `product_product_values`.`product_value_id` as `pivot_product_value_id` from `product_values` inner join `product_product_values` on `product_values`.`id` = `product_product_values`.`product_value_id` where `product_product_values`.`product_id` = 7
select * from `value_options` where `value_options`.`id` in (3, 4, 11, 14, 15)
select * from `options` where `options`.`id` in (1, 2)
---
        }


        $options = Option::with('values')->get();

        $selected_product_values = $product->productValues()->get();
        $selected_values = null;

        $selected_product_values->load(['valueOption' => function ($items) use (&$selected_values) {
            $selected_values = $items->get();
        }]);
        $selected = [];
        $select_options = null;
        if ($selected_values != null) {
            $selected_values->load(['select_options' => function ($items) use (&$select_options) {
                $select_options = $items->get();
            }]);

select * from `group_attributes` where `group_attributes`.`id` in (1, 2, 3, 4)
select `attributes`.*, `product_attribute`.`product_id` as `pivot_product_id`, `product_attribute`.`attribute_id` as `pivot_attribute_id` from `attributes` inner join `product_attribute` on `attributes`.`id` = `product_attribute`.`attribute_id` where `product_attribute`.`product_id` in (7)
select `attributes`.*, `product_attribute`.`product_id` as `pivot_product_id`, `product_attribute`.`attribute_id` as `pivot_attribute_id`, `product_attribute`.`product_id` as `pivot_product_id`, `product_attribute`.`attribute_id` as `pivot_attribute_id` from `attributes` inner join `product_attribute` on `attributes`.`id` = `product_attribute`.`attribute_id` where `product_attribute`.`product_id` in (7)
---
        $select_attributes = null;


        $product->load(['attributes.group_attribute' => function ($items) use (&$group_attributes) {
            $group_attributes = $items->get();
        }]);

        $product->load(['attributes' => function ($items) use (&$select_attributes) {
            $select_attributes = $items->get();
        }]);

select * from `tags`
select `tags`.*, `product_tag`.`product_id` as `pivot_product_id`, `product_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `product_tag` on `tags`.`id` = `product_tag`.`tag_id` where `product_tag`.`product_id` = 7
---

            }
        }
        $tags = Tag::all();

        $arr_tags = $product->tags()->get();

select * from `languages`
---
            $selected_tags[] = $tag->id;
        }

        $langs = Language::all();

update `products` set `title_ru` = 'Новые ультрамодные перчатки!sa', `title_uk` = 'Тайтл перчаток на украинскомas', `slug_ru` = 'Новые ультрамодные перчатки!sa', `slug_uk` = 'Тайтл перчаток на украинскомas', `status_stock` = 0, `products`.`updated_at` = '2021-01-24 19:43:04' where `id` = 7
delete from `product_product_values` where `product_id` = 9
delete from `product_product_values` where `product_id` = 7
---
            $product->image = $image->name;
        }

        $product->save();


        $product->productValues()->delete();
        $product->productValues()->detach();

select * from `languages`
---
            $values[] = $product_value->id;
        }

        $langs = Language::all();

insert into `product_product_values` (`product_id`, `product_value_id`) values (7, 33), (7, 34), (7, 35), (7, 36), (7, 37)
---
            $product->categories()->syncWithoutDetaching($request->category_id);
        }
//dd($gallery);
        $product->productValues()->attach($values);