app/Http/Controllers/TagController.php

select * from `tags`
select * from `contacts`
select * from `orders`
---
	public function indexAdmin( Request $request ) {
		//разрешаем админу
		$request->user()->authorizeRoles( [ 'admin' ] );

		$tags = Tag::all();

		$contacts      = Contact::all();
		$contacts_count   = $contacts->count();
		$orders        = Order::all();

select * from `languages`
select * from `contacts`
select * from `orders`
---
	public function create( Request $request ) {
		//разрешаем админу
		$request->user()->authorizeRoles( [ 'admin' ] );

		$tag = null;
		$langs = Language::all();

		$contacts      = Contact::all();
		$contacts_count   = $contacts->count();
		$orders        = Order::all();

insert into `tags` (`name_ru`, `name_uk`, `updated_at`, `created_at`) values ('tag 33', 'tag 33 uk', '2021-01-24 11:53:03', '2021-01-24 11:53:03')
select * from `languages`
---
	public function store( Request $request ) {

		$tag = new Tag;

		$tag->name_ru = $request->title_ru;
		$tag->name_uk = $request->title_uk;
		$tag->save();


        $langs = Language::all();

select * from `contacts`
select * from `orders`
select * from `languages`
---
	public function edit( Request $request, $id ) {
		//разрешаем админу
		$request->user()->authorizeRoles( [ 'admin' ] );
		$contacts      = Contact::all();
		$contacts_count   = $contacts->count();
		$orders        = Order::all();
		$order_count   = $orders->count();
        $langs = Language::all();