<?php
// RU
return [
  // Main menu
    'menu' => [
        'delivery' => 'Доставка',
        'pay' => 'Оплата',
        'guarantee' => 'Гарантия и возврат',
        'contacts' => 'Контакты',
        'blog' => 'Блог',
        'reviews' => 'Отзывы',
        'schedule' => 'График работы с 08 – 21 (пн.-пт.) и с 09 – 20 (сб.-вс.)',
        'query' => 'Введите Ваш запрос',
        'call' => 'Звоните нам:',
        'geo' => 'Мы находимся:',
        'map' => 'Показать на карте',
        'call_me' => 'перезвоните мне'
    ],

    'header' => [
        'gloves' => 'Перчатки',
        'glasses' => 'Очки',
        'sail' => 'Акция',
        'male' => 'Мужские',
        'female' => 'Женские',
        'auto' => 'Автомобильные',
        'sport' => 'Спортивные'
    ],

    'pre-footer' => [
        'veis' => 'ИНТЕРНЕТ МАГАЗИН АКСЕССУАРОВ В УКРАИНЕ – VEIS',
        'desc' => 'Мы – интернет магазин качественных перчаток и брендовых аксессуаров «Veis» предлагаем широкий ассортимент товаров в наличии. На страницах сайта вы сможете найти кожаные перчатки для женщин и мужчин на любую погоду, автомобильные перчатки, очки, зонты.',
        'read' => 'Читать далее'
    ],

    'footer' => [
        'catalog' => 'КАТАЛОГ',
        'about_magazine' => 'О МАГАЗИНЕ',
        'buyers' => 'ПОКУПАТЕЛЯМ',
        'contacts' => 'КОНТАКТЫ',
        'female_gloves' => 'ЖЕНСКИЕ ПЕРЧАТКИ',
        'male_gloves' => 'МУЖСКИЕ ПЕРЧАТКИ',
        'female_bags' => 'СУМКИ ЖЕНСКИЕ',
        'male_bags' => 'СУМКИ МУЖСКИЕ',
        'accessories' => 'АКСЕССУАРЫ',
        'accessories_lower' => 'Аксессуары',
        'sunglasses' => 'ОЧКИ СОЛНЦЕЗАЩИТНЫЕ',
        'sportglasses' => 'ОЧКИ СПОРТИВНЫЕ',
        'sail' => 'АКЦИЯ',
        'about_us' => 'О нас',
        'articles' => 'Статьи',
        'replies' => 'Отзывы',
        'map' => 'Карта сайта',
        'return' => 'Возврат',
        'copyright' => 'ИНТЕРНЕТ МАГАЗИН VEIS ВСЕ ПРАВА ЗАЩИЩЕНЫ',
        'social' => 'Мы в социальных сетях'
    ],

    'productCard' => [
        'new' => 'НОВИНКИ',
        'sale' => 'РАСПРОДАЖА',
        'gloves' => 'ПЕРЧАТКИ',
        'sunglasses' => 'СОЛНЦЕЗАЩИТНЫЕ ОЧКИ',
        'umbrellas' => 'ЗОНТЫ',
        'bags' => 'СУМКИ',
        'watch' => 'посмотреть',
        'buy' => 'КУПИТЬ',
        'price' => 'цена',
        'color' => 'Цвет',
        'show_all' => 'Показать все',
        'viewed' => 'ПРОСМОТРЕННОЕ'
    ],

    'products' => [
        'umbrellas' => 'ЗОНТЫ',
        'bags' => 'СУМКИ',
        'portfolios' => 'ПОРТФЕЛИ',
        'wallets' => 'КОШЕЛЬКИ',
        'glasses' => 'ОЧКИ',
        'details' => 'Подробнее',
    ],

    'howWeDoing' => [
        'how' => 'КАК МЫ РАБОТАЕМ',
        'schema' => 'Схема работы нашего магазина, от заказа и до получения товара.',
        'leave' => 'оставляете заявку',
        'call_back' => 'менеджер перезванивает',
        'clarify' => 'уточняем наличие',
        'form' => 'формируем отгружаем',
        'send' => 'отправляем заказ',
        'receive' => 'получение товара',
    ],

    'consultation' => [
        'want' => 'ХОЧЕШЬ ПОЛУЧИТЬ ПОЛНУЮ КОНСУЛЬТАЦИЮ О ТОВАРЕ И НОВИНКАХ?',
        'send' => 'Отправить'
    ],

    'catalog' => [
        'filter' => 'ФИЛЬТР',
        'sort' => 'СОРТИРОВАТЬ',
        'newest' => 'НОВИНКИ',
        'price_asc' => 'ОТ ДЕШЕВЫХ К ДОРОГИМ',
        'price_desc' => 'ОТ ДОРОГИХ К ДЕШЕВЫМ',
        'for' => 'ДЛЯ КОГО',
        'manuf' => 'ПРОИЗВОДИТЕЛЬ',
        'shape' => 'ФОРМА ОПРАВЫ',
        'uv_filter' => 'UV ФИЛЬТР',
        'lensColor' => 'ЦВЕТ ЛИНЗ',
        'frameColor' => 'ЦВЕТ ОПРАВЫ',
        'gradient' => 'ГРАДИЕНТ',
        'frameMaterial' => 'МАТЕРИАЛ ОПРАВЫ',
        'features' => 'ОСОБЕННОСТИ',
        'tags' => 'ТЕГИ',
        'priceUp' => 'ЦЕНА',
        'use_filter' => 'ПРИМЕНИТЬ',
        'reset' => 'Сбросить фильтр',
        'next' => 'следующая',
        'prev' => 'предыдущая',
        'cancel' => 'ОТМЕНИТЬ',
        'is_sale' => 'товар по акции',
        'category' => 'Категория: ',
    ],

    'info' => [
        'useful' => 'ПОЛЕЗНАЯ ИНФОРМАЦИЯ',
        'del' => 'ДОСТАВКА',
        'pay' => 'ОПЛАТА',
        'back' => 'ВОЗВРАТ',
        'back_prod' => 'ВОЗВРАТ ТОВАРА',
        'guarantee' => 'ГАРАНТИЯ',
    ]
];
