<?php
// UK
return [
    // Main menu
    'menu' => [
        'delivery' => 'Доставка',
        'pay' => 'Оплата',
        'guarantee' => 'Гарантія та повернення',
        'contacts' => 'Контакти',
        'blog' => 'Блог',
        'reviews' => 'Відгуки',
        'schedule' => 'Графік роботи з 08 - 21 (пн.-пт.) і з 09 - 20 (сб.-нд.)',
        'query' => 'Введіть Ваш запит',
        'call' => 'Телефонуйте нам:',
        'geo' => 'Ми знаходимося:',
        'map' => 'Показати на мапі',
        'call_me' => 'передзвоніть мені'
    ],

    'header' => [
        'gloves' => 'Рукавички',
        'glasses' => 'Окуляри',
        'sail' => 'Акція',
        'male' => 'Чоловічі',
        'female' => 'Жіночі',
        'auto' => 'Автомобільні',
        'sport' => 'Спортивні'
    ],

    'pre-footer' => [
        'veis' => 'ІНТЕРНЕТ МАГАЗИН АКСЕСУАРІВ В УКРАЇНІ - VEIS',
        'desc' => 'Ми - інтернет магазин якісних рукавичок і брендових аксесуарів «Veis» пропонуємо широкий асортимент товарів в наявності. На сторінках сайту ви зможете знайти шкіряні рукавички для жінок і чоловіків на будь-яку погоду, автомобільні рукавички, окуляри, парасольки.',
        'read' => 'Читати далі'
    ],

    'footer' => [
        'catalog' => 'КАТАЛОГ',
        'about_magazine' => 'ПРО МАГАЗИН',
        'buyers' => 'ПОКУПЦЯМ',
        'contacts' => 'КОНТАКТИ',
        'female_gloves' => 'ЖІНОЧІ РУКАВИЧКИ',
        'male_gloves' => 'ЧОЛОВІЧІ РУКАВИЦІ',
        'female_bags' => 'СУМКИ ЖІНОЧІ',
        'male_bags' => 'СУМКИ ЧОЛОВІЧІ',
        'accessories' => 'АКСЕСУАРИ',
        'accessories_lower' => 'Аксесуари',
        'sunglasses' => 'ОКУЛЯРИ СОНЦЕЗАХИСНІ',
        'sportglasses' => 'ОЧКИ СПОРТИВНІ',
        'sail' => 'АКЦІЯ',
        'about_us' => 'Про нас',
        'articles' => 'Статті',
        'replies' => 'Відгуки',
        'map' => 'Карта сайту',
        'return' => 'Повернення',
        'copyright' => 'ІНТЕРНЕТ МАГАЗИН VEIS ВСІ ПРАВА ЗАХИЩЕНІ',
        'social' => 'Ми в соціальних мережах'
    ],

    'productCard' => [
        'new' => 'НОВИНКИ',
        'sale' => 'РОЗПРОДАЖ',
        'gloves' => 'РУКАВИЧКИ',
        'sunglasses' => 'СОНЦЕЗАХИСНІ ОКУЛЯРИ',
        'umbrellas' => 'ПАРАСОЛЬКИ',
        'bags' => 'СУМКИ',
        'watch' => 'подивитися',
        'buy' => 'КУПИТИ',
        'price' => 'ціна',
        'color' => 'Колір',
        'show_all' => 'Показати всі',
        'viewed' => 'ПЕРЕГЛЯНУТI'
    ],

    'products' => [
        'umbrellas' => 'ПАРАСОЛЬКИ',
        'bags' => 'СУМКИ',
        'portfolios' => 'ПОРТФЕЛІ',
        'wallets' => 'ГАМАНЦІ',
        'glasses' => 'ОКУЛЯРИ',
        'details' => 'Детальніше',
    ],

    'howWeDoing' => [
        'how' => 'ЯК МИ ПРАЦЮЄМО',
        'schema' => 'Схема роботи нашого магазину, від замовлення і до отримання товару.',
        'leave' => 'залишаєте заявку',
        'call_back' => 'менеджер передзвонює',
        'clarify' => 'уточнюємо наявність',
        'form' => 'формуємо відвантажуємо',
        'send' => 'відправляємо замовлення',
        'receive' => 'отримання товару',
    ],

    'consultation' => [
        'want' => 'ХОЧЕШ ОТРИМАТИ ПОВНУ КОНСУЛЬТАЦІЮ ПРО ТОВАРИ ТА НОВИНКИ?',
        'send' => 'Надіслати'
    ],

    'catalog' => [
        'filter' => 'ФІЛЬТР',
        'sort' => 'СОРТУВАТИ',
        'newest' => 'НОВИНКИ',
        'price_asc' => 'ВIД ДЕШЕВИХ ДО ДОРОГИХ',
        'price_desc' => 'ВІД ДОРОГИХ ДО ДЕШЕВИМ',
        'for' => 'ДЛЯ КОГО',
        'manuf' => 'ВИРОБНИК',
        'shape' => 'ФОРМА ОПРАВИ',
        'uv_filter' => 'UV ФIЛЬТР',
        'lensColor' => 'КОЛІР ЛІНЗ',
        'frameColor' => 'КОЛІР ОПРАВИ',
        'gradient' => 'ГРАДІЄНТ',
        'frameMaterial' => 'МАТЕРІАЛ ОПРАВИ',
        'features' => 'ОСОБЛИВОСТІ',
        'tags' => 'ТЕГИ',
        'priceUp' => 'ЦІНА',
        'use_filter' => 'ПРИМЕНИТЬ',
        'reset' => 'Скинути фільтр',
        'next' => 'наступна',
        'prev' => 'попередня',
        'cancel' => 'СКАСУВАТИ',
        'is_sale' => 'товар по акції',
        'category' => 'Категорія: ',
    ],

    'info' => [
        'useful' => 'КОРИСНА ІНФОРМАЦІЯ',
        'del' => 'ДОСТАВКА',
        'pay' => 'ОПЛАТА',
        'back' => 'ПОВЕРНЕННЯ',
        'back_prod' => 'ПОВЕРНЕННЯ ТОВАРУ',
        'guarantee' => 'ГАРАНТІЯ',
    ],

    'map' => [
        'main' => 'Головна',
        'catalog' => 'Каталог товарів',
        'info' => 'Інформація про нас',
        'blog' => 'Блог',
    ]
];