<?php
// UK
return [
    // Main menu
    'menu' => [
        'delivery' => 'Доставка',
        'pay' => 'Оплата',
        'guarantee' => 'Гарантія',
        'contacts' => 'Контакти',
        'blog' => 'Блог',
        'reviews' => 'Відгуки',
        'schedule' => 'Графік роботи з 08 - 21 (пн.-пт.) і з 09 - 20 (сб.-нд.)',
        'query' => 'Введіть Ваш запит',
        'call' => 'Телефонуйте нам:',
        'geo' => 'Ми знаходимося:',
        'map' => 'Показати на мапі',
        'call_me' => 'передзвоніть мені',

        'more' => 'ДЕТАЛЬНІШЕ',
        'watchAll' => 'Дивитися всі статті',
    ],

    'header' => [
        'gloves' => 'Рукавички',
        'glasses' => 'Окуляри',
        'sail' => 'Акція',
        'male' => 'Чоловічі',
        'female' => 'Жіночі',
        'auto' => 'Автомобільні',
        'sport' => 'Спортивні'
    ],

    'pre-footer' => [
        'veis' => 'ІНТЕРНЕТ МАГАЗИН АКСЕСУАРІВ В УКРАЇНІ - VEIS',
        'desc' => 'Ми - інтернет магазин якісних рукавичок і брендових аксесуарів «Veis» пропонуємо широкий асортимент товарів в наявності. На сторінках сайту ви зможете знайти шкіряні рукавички для жінок і чоловіків на будь-яку погоду, автомобільні рукавички, окуляри, парасольки.',
        'read' => 'Читати далі'
    ],

    'footer' => [
        'catalog' => 'КАТАЛОГ',
        'about_magazine' => 'ПРО МАГАЗИН',
        'buyers' => 'ПОКУПЦЯМ',
        'contacts' => 'КОНТАКТИ',
        'female_gloves' => 'ЖІНОЧІ РУКАВИЧКИ',
        'male_gloves' => 'ЧОЛОВІЧІ РУКАВИЦІ',
        'female_bags' => 'СУМКИ ЖІНОЧІ',
        'male_bags' => 'СУМКИ ЧОЛОВІЧІ',
        'accessories' => 'АКСЕСУАРИ',
        'accessories_lower' => 'Аксесуари',
        'sunglasses' => 'ОКУЛЯРИ СОНЦЕЗАХИСНІ',
        'sportglasses' => 'ОКУЛЯРИ СПОРТИВНІ',
        'sail' => 'АКЦІЯ',
        'about_us' => 'Про нас',
        'articles' => 'Статті',
        'replies' => 'Відгуки',
        'map' => 'Мапа сайту',
        'return' => 'Повернення',
        'copyright' => 'ІНТЕРНЕТ МАГАЗИН VEIS ВСІ ПРАВА ЗАХИЩЕНІ',
        'social' => 'Ми в соціальних мережах'
    ],

    'productCard' => [
        'new' => 'НОВИНКИ',
        'sale' => 'РОЗПРОДАЖ',
        'gloves' => 'РУКАВИЧКИ',
        'sunglasses' => 'СОНЦЕЗАХИСНІ ОКУЛЯРИ',
        'umbrellas' => 'ПАРАСОЛЬКИ',
        'bags' => 'СУМКИ',
        'watch' => 'подивитися',
        'buy' => 'КУПИТИ',
        'price' => 'ціна',
        'color' => 'Колір',
        'show_all' => 'Показати всі',
        'viewed' => 'ПЕРЕГЛЯНУТI'
    ],

    'products' => [
        'umbrellas' => 'ПАРАСОЛЬКИ',
        'bags' => 'СУМКИ',
        'portfolios' => 'ПОРТФЕЛІ',
        'wallets' => 'ГАМАНЦІ',
        'glasses' => 'ОКУЛЯРИ',
        'details' => 'Детальніше',
    ],

    'howWeDoing' => [
        'how' => 'ЯК МИ ПРАЦЮЄМО',
        'schema' => 'Схема роботи нашого магазину, від замовлення і до отримання товару.',
        'leave' => 'залишаєте заявку',
        'call_back' => 'менеджер передзвонює',
        'clarify' => 'уточнюємо наявність',
        'form' => 'формуємо відвантажуємо',
        'send' => 'відправляємо замовлення',
        'receive' => 'отримання товару',
    ],

    'consultation' => [
        'want' => 'БАЖАЄШ ОТРИМАТИ ПОВНУ КОНСУЛЬТАЦІЮ ПРО ТОВАРИ ТА НОВИНКИ?',
        'send' => 'Надіслати'
    ],

    'catalog' => [
        'filter' => 'ФІЛЬТР',
        'sort' => 'СОРТУВАТИ',
        'newest' => 'НОВИНКИ',
        'price_asc' => 'ДЕШЕВШЕ',
        'price_desc' => 'ДОРОЖЧЕ',
        'for' => 'ДЛЯ КОГО',
        'manuf' => 'ВИРОБНИК',
        'shape' => 'ФОРМА ОПРАВИ',
        'uv_filter' => 'UV ФIЛЬТР',
        'lensColor' => 'КОЛІР ЛІНЗ',
        'frameColor' => 'КОЛІР ОПРАВИ',
        'gradient' => 'ГРАДІЄНТ',
        'frameMaterial' => 'МАТЕРІАЛ ОПРАВИ',
        'features' => 'ОСОБЛИВОСТІ',
        'tags' => 'ТЕГИ',
        'priceUp' => 'ЦІНА',
        'use_filter' => 'ЗАСТОСУВАТИ',
        'reset' => 'Скинути фільтр',
        'next' => 'наступна',
        'prev' => 'попередня',
        'cancel' => 'СКАСУВАТИ',
        'is_sale' => 'товар по акції',
        'category' => 'Категорія: ',
        'show_more' => 'ПОКАЗАТИ ЩЕ',
        'in_this_cat' => ' В ЦІЙ КАТЕГОРІЇ',
        'all1' => 'всього ',
        'all2' => ' товару',
    ],

    'info' => [
        'useful' => 'КОРИСНА ІНФОРМАЦІЯ',
        'del' => 'ДОСТАВКА',
        'pay' => 'ОПЛАТА',
        'back' => 'ПОВЕРНЕННЯ',
        'back_prod' => 'ПОВЕРНЕННЯ ТОВАРУ',
        'guarantee' => 'ГАРАНТІЯ',
    ],

    'map' => [
        'main' => 'Головна',
        'catalog' => 'Каталог товарів',
        'info' => 'Корисна iнформацiя',
        'blog' => 'Блог',
        'manufacturers' => 'Виробники',
        'tags' => 'Теги',
    ],

    'basket' => [
        'form' => 'ФОРМА ЗАМОВЛЕННЯ',
        'fill' => 'Заповніть форму, щоб ми могли зв\'язатися з вами для уточнення замовлення.',
        'fastForm' => 'ШВИДКА ФОРМА ЗАМОВЛЕННЯ',
        'fullForm' => 'Повна форма',
        'data' => 'ІНФОРМАЦІЯ',
        'name' => 'Iм\'я*',
        'connection' => 'СПОСІБ ЗВ\'ЯЗКУ',
        'phone' => 'Телефон*',
        'userData' => 'ДАНІ ПОКУПЦЯ',
        'surname' => 'Прізвище',
        'fatherland' => 'По батькові',

        'wayToDel' => 'СПОСІБ НАДСИЛАННЯ',
        'option' => 'Варіант доставки',
        'city' => 'Місто',
        'department' => 'Відділення Нової Пошти',
        'address' => 'Адрес',
        'comment' => 'Ваш коментар',
        'wayToPay' => 'СПОСІБ ОПЛАТИ',
        'choose' => 'Виберіть відповідний для Вас варіант',
        'pay' => 'ЗРОБИТИ ПОКУПКУ',
        'delCost' => 'Вартість доставки:',
        'free' => 'безкоштовно',
        'price' => 'ДО CПЛАТИ:',

        'yourProducts' => 'ВАШІ ВИБРАНI ТОВАРИ',
        'fullList' => 'Повний список відібраних товарів, відредагуйте і натисніть замовити',
        'back' => 'Повернутися назад',

        'chooseCity' => 'Введіть Ваше місто',
        'choosePoint' => 'Введіть Ваш пункт видачі',
        'chooseAddress' => 'Введіть Вашу адресу',
        'thanks' => 'ДЯКУЄМО',
        'confirm' => 'Ваше замовлення оформлено',

        'novaDel' => 'У відділенні Нової Пошти',
        'ukrDel' => 'У відділенні Укр Пошти',
        'pickupDel' => 'Iнше',
    ],

    'notFound' => [
        'notFound' => 'На жаль запитувана Вами сторінка не знайдена',
        'onMain' => 'На головну',
        'after' => 'через',
        'seconds' => 'секунд ми перенесемо Вас на головну.',
        'input' => 'Введіть ваш запит'
    ],

    'search' => [
        'crumb' => 'ПОШУК ПО САЙТУ',
        'search' => 'ПОШУК',
        'founded' => 'ЗНАЙДЕНО',
    ]
];